#ifndef EMOJIFISH_H
#define EMOJIFISH_H

#include "../EmojiList.h"

static const QList<EmojiData> emojiFish = {
    {"🐟", {"рыба", "океан", "река", "море"}},
    {"🐠", {"тропическая", "рыба", "океан", "красочная"}},
    {"🐡", {"рыба", "фугу", "океан", "иглобрюх"}},
    {"🦈", {"акула", "океан", "опасность", "хищник"}},
    {"🐙", {"осьминог", "океан", "моллюск", "щупальца"}},
    {"🦑", {"кальмар", "океан", "моллюск"}},
    {"🦐", {"креветка", "морепродукты", "океан"}},
    {"🦞", {"омар", "рак", "морепродукты"}},
    {"🦀", {"краб", "океан", "ракообразное"}},
    {"🐚", {"раковина", "море", "океан", "моллюск"}},
    {"🪸", {"коралл", "риф", "океан", "морской"}},
    {"🎣", {"удочка", "рыбалка", "рыба"}},
    {"🐬", {"дельфин", "океан", "млекопитающее"}},
    {"🐳", {"кит", "океан", "млекопитающее"}},
    {"🐋", {"кит", "океан", "млекопитающее"}},
    {"🦭", {"тюлень", "океан", "ластоногие"}},
    {"🦦", {"выдра", "река", "животное"}}
};

#endif // EMOJIFISH_H