#ifndef EMOJIHEARTS_H
#define EMOJIHEARTS_H

#include "../EmojiList.h"

static const QList<EmojiData> emojiHearts = {
    {"💘", {"любовь", "сердце", "влюбленность", "купидон"}},
    {"💝", {"любовь", "сердце", "подарок", "лента"}},
    {"💖", {"любовь", "сердце", "блестящий"}},
    {"💗", {"любовь", "сердце", "растущий"}},
    {"💓", {"любовь", "сердце", "бьется"}},
    {"💞", {"любовь", "сердца", "вращающиеся"}},
    {"💕", {"любовь", "сердца", "два"}},
    {"💟", {"любовь", "сердце", "украшение"}},
    {"❣️", {"любовь", "сердце", "восклицание"}},
    {"💔", {"разбитое", "сердце", "любовь", "расставание"}},
    {"❤️", {"любовь", "сердце", "красный"}},
    {"🧡", {"любовь", "сердце", "оранжевый"}},
    {"💛", {"любовь", "сердце", "желтый"}},
    {"💚", {"любовь", "сердце", "зеленый"}},
    {"💙", {"любовь", "сердце", "синий"}},
    {"💜", {"любовь", "сердце", "фиолетовый"}},
    {"🤎", {"любовь", "сердце", "коричневый"}},
    {"🖤", {"любовь", "сердце", "черный"}},
    {"🤍", {"любовь", "сердце", "белый"}},
    {"❤️‍🔥", {"горящее", "сердце", "страсть"}},
    {"❤️‍🩹", {"исцеляющее", "сердце", "восстановление"}}
};

#endif // EMOJIHEARTS_H