#ifndef EMOJISPORTS_H
#define EMOJISPORTS_H

#include "../EmojiList.h"

static const QList<EmojiData> emojiSports = {
    {"⚽", {"футбол", "мяч", "спорт"}},
    {"🏀", {"баскетбол", "мяч", "спорт"}},
    {"🏈", {"американский", "футбол", "мяч", "спорт"}},
    {"⚾", {"бейсбол", "мяч", "спорт"}},
    {"🥎", {"софтбол", "мяч", "спорт"}},
    {"🎾", {"теннис", "мяч", "спорт"}},
    {"🏐", {"волейбол", "мяч", "спорт"}},
    {"🏉", {"регби", "мяч", "спорт"}},
    {"🥏", {"фрисби", "диск", "спорт"}},
    {"🎱", {"бильярд", "шар", "спорт"}},
    {"🪀", {"йо", "йо", "игрушка"}},
    {"🏓", {"пинг", "понг", "настольный", "теннис"}},
    {"🏸", {"бадминтон", "спорт"}},
    {"🏒", {"хоккей", "спорт"}},
    {"🏑", {"хоккей", "трава", "спорт"}},
    {"🥍", {"лакросс", "спорт"}},
    {"🏏", {"крикет", "спорт"}},
    {"🪃", {"бумеранг", "спорт"}},
    {"🥅", {"ворота", "сетка", "спорт"}},
    {"⛳", {"гольф", "флаг", "спорт"}},
    {"🪁", {"воздушный", "змей", "игрушка"}},
    {"🏹", {"лук", "стрелы", "спорт"}},
    {"🎣", {"рыбалка", "удочка", "спорт"}},
    {"🤿", {"дайвинг", "маска", "спорт"}},
    {"🎽", {"майка", "бег", "спорт"}},
    {"🎿", {"лыжи", "спорт"}},
    {"🛷", {"санки", "спорт"}},
    {"🥌", {"керлинг", "камень", "спорт"}},
    {"🎯", {"дартс", "мишень", "спорт"}}
};

#endif // EMOJISPORTS_H