#ifndef EMOJITRANSPORT_H
#define EMOJITRANSPORT_H

#include "../EmojiList.h"

static const QList<EmojiData> emojiTransport = {
    {"🚗", {"автомобиль", "машина", "транспорт"}},
    {"🚙", {"внедорожник", "автомобиль", "транспорт"}},
    {"🚐", {"микроавтобус", "транспорт"}},
    {"🚛", {"грузовик", "фура", "транспорт"}},
    {"🏎️", {"гоночный", "автомобиль", "спорт"}},
    {"🚓", {"полиция", "автомобиль", "милиция"}},
    {"🚑", {"скорая", "помощь", "медицина"}},
    {"🚒", {"пожарная", "машина", "огонь"}},
    {"🚲", {"велосипед", "транспорт", "спорт"}},
    {"🛵", {"мопед", "скутер", "транспорт"}},
    {"🏍️", {"мотоцикл", "транспорт", "спорт"}},
    {"🚂", {"поезд", "железная", "дорога"}},
    {"🚄", {"скоростной", "поезд", "транспорт"}},
    {"🚝", {"монорельс", "транспорт"}},
    {"🚁", {"вертолет", "авиация", "транспорт"}},
    {"✈️", {"самолет", "авиация", "транспорт"}},
    {"🛩️", {"маленький", "самолет", "авиация"}},
    {"🚀", {"ракета", "космос", "старт"}},
    {"🛸", {"летающая", "тарелка", "НЛО"}},
    {"🚢", {"корабль", "судно", "море"}},
    {"⛵", {"парусник", "лодка", "море"}},
    {"🚤", {"катер", "лодка", "скорость"}},
    {"🛳️", {"пассажирский", "лайнер", "корабль"}},
    {"🚜", {"трактор", "сельское", "хозяйство"}},
    {"🏎️", {"гоночный", "автомобиль", "скорость"}},
    {"🚨", {"мигалка", "сирена", "полиция"}},
    {"🚔", {"полицейская", "машина", "милиция"}},
    {"🚍", {"автобус", "транспорт", "город"}},
    {"🚟", {"подвесная", "дорога", "транспорт"}},
    {"🚠", {"канатная", "дорога", "подъемник"}},
    {"🚡", {"воздушный", "трамвай", "транспорт"}},
    {"🚊", {"трамвай", "транспорт", "город"}},
    {"🚞", {"горный", "поезд", "железная", "дорога"}},
    {"🛶", {"каноэ", "лодка", "гребля"}},
    {"🚁", {"вертолет", "авиация", "небо"}}
};

#endif // EMOJITRANSPORT_H